ErpTest/src/Enums/ТипыЗапасов/ТипыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗапасов</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйТовар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>АгентскаяУслуга</name>
  </enumValues>
  <enumValues>
    <name>ТоварНаХраненииСПравомПродажи</name>
    <comment>Товар, принятый на ответственное хранение с целью дальнейшей продажи</comment>
  </enumValues>
  <enumValues>
    <name>СобственныйТоварВПути</name>
  </enumValues>
  <enumValues>
    <name>СобственныйТоварПоНеотфактурованнойПоставке</name>
  </enumValues>
  <enumValues>
    <name>ТоварТребующийПодтвержденияВыпуска</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/ТипыЗапасов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает типы запасов, которые нужно контролировать на остатках организаций.
// 
// Возвращаемое значение:
//  Массив - массив элементов типа ПеречислениеСсылка.ТипыЗапасов
//
Функция КонтролируемыеТипыЗапасов() Экспорт
	
	КонтролируемыеТипыЗапасов = Новый Массив;
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.Товар);
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.МатериалДавальца);
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ПродукцияДавальца);
	КонтролируемыеТипыЗапасов.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	Возврат КонтролируемыеТипыЗапасов;
	
КонецФункции

// Возвращает типы запасов, владельцы которых не содержатся в справочнике Организации.
// 
// Возвращаемое значение:
//  Массив - массив элементов типа ПеречислениеСсылка.ТипыЗапасов
//
Функция ТипыЗапасовВнешнийВладелец() Экспорт
	
	ТипыЗапасовВнешнийВладелец = Новый Массив;
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.КомиссионныйТовар);
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.МатериалДавальца);
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.ПродукцияДавальца);
	ТипыЗапасовВнешнийВладелец.Добавить(Перечисления.ТипыЗапасов.ТоварНаХраненииСПравомПродажи);
	Возврат ТипыЗапасовВнешнийВладелец;
	
КонецФункции

#КонецОбласти

#КонецЕсли
